export interface Analysis {
  id: string;
  subject: string;
  content: string;
  image: string;
}

export const analyticsData: Analysis[] = [
  {
    id: 'echo',
    subject: 'إيكو – جيسون هايس',
    content: 'جل الميدان بامتياز وذكاء حادّ يصل لأبعد الحدود. دائم المناوشات مع إيجنت إكس، لا يقبل أي انتقاص من هيبة الوكالة، وطموحه يجعل منه خصمًا محنكًا ومنافسًا لا يُستهان به. هادئ، بارد، شبح في الظل… حاضر دائمًا لكن بعيد عن الأضواء.',
    image: 'https://i.postimg.cc/HW9520hQ/6fc0fb18b2d489f1.jpg'
  },
  {
    id: 'azir',
    subject: 'إيزير',
    content: 'قائد في الـCIA، حضوره ترك أثرًا لا يُنسى. مسؤول عن مقر الإمدادات، ميداني وعسكري بحت، يتقن إدارة الميدان أكثر من أي مكتب قيادة. مكانه الطبيعي بين العتاد، صامت لكن تأثيره كبير، قائد يولد الثقة منذ اللحظة الأولى.',
    image: 'https://i.postimg.cc/kMs68JVn/eb709eff49937dc9.jpg'
  },
  {
    id: 'rambo',
    subject: 'رامبو',
    content: 'بدأ كعدو لألفا، وانتهى سجينًا في البلاك سايد. عاد ليصبح قائدًا صارمًا، لا مكان للفكاهة في قاموسه. أنشأ كتيبة الموت بعد انشقاقه، وعند عودته تم دمجها ضمن الـCIA، لتصبح جزءًا من قوة الوكالة الصلبة. شبحٌ حاضر في كل العمليات، تاريخٌ لا يُنسى.',
    image: 'https://i.postimg.cc/qqDvF7nM/Screenshot.jpg'
  },
  {
    id: 'andrew',
    subject: 'الدكتور أندرو',
    content: 'بدأ طبيبًا غريب الأطوار، شبه مختل، يبحث عن تجارب على المرضى. الزمن غيّره، فأصبح أكثر هدوءًا ورزانة، وكسب ثقة ألفا سريعًا شخصية لا يمكن الشك في ولائها للقطاع، وقائد فرقة القناصة في الـCIA، يجمع بين الدقة الطبية والخبرة الميدانية، ليكون عنصرًا حاسمًا في أصعب العمليات',
    image: 'https://i.postimg.cc/YCWCXMSk/ce4ac354f0d42b35.jpg'
  },
  {
    id: 'beta',
    subject: 'بيتا',
    content: 'بدأ كعنصر صغير بالكود إيجنت B، ثم ارتقى إلى منصب القيادة وحصل على كود بيتا. رغم الشائعات حول خيانته، الواقع يُظهره صامدًا، وهو من حمل الـCIA على كتفيه في أصعب الفترات الأخيرة. شخصية مركزية وميدانية، لا يمكن تجاهلها.',
    image: 'https://i.postimg.cc/3RKrJGF8/7591f7a7768abb33.jpg'
  },
  {
    id: 'michael',
    subject: 'مايكل كونر',
    content: 'أو مشاري، قائد جديد نال ثقة ألفا سريعًا. شخص مهووس بالحسم والإعدام، وسلاحه المفضل القناصة. يعتمد عليه في الميدان، وتم تسليمه قيادة فرقة "الميليشيا" داخل الـCIA، ليكون عنصرًا حاسمًا في أخطر العمليات، صامدًا ودقيقًا بلا مساومة.',
    image: 'https://i.postimg.cc/KcpcxRky/a716cdbfa2d71cae.jpg'
  },
  {
    id: 'agentx',
    subject: 'إيجنت إكس',
    content: 'نائب الـCIA سابقاً وخط الدفاع الأوّل للوكالة، شخص ميداني ومحنك، يجمع بين الجدية والفكاهة حين تتطلب الحاجة. لا يقبل أي استنقاص من هيبة الوكالة، وقد خاض صراعًا مع إيكو على خلافة ألفا، محافظًا على مكانة القطاع. شبح من أشباح الـCIA، حاضر في أخطر الميادين',
    image: 'https://i.postimg.cc/q7G0YRVP/0b8d0a32a8fb212e.jpg'
  }
];
