export interface Case {
  id: string;
  subject: string;
  content: string;
  image: string;
}

export const casesData: Case[] = [
  {
    id: 'alshaab',
    subject: 'حزب الشعب',
    content: `تأسس حزب الشعب على يد فان دام وأبو سويحان برفقة أبو محمد، مدفوعين برغبتهم في إقامة دولة يقودها رئيس خاص بهم. وتمكنوا من بسط سيطرتهم على مناطق بوليتو وساندي، حيث عملوا على إعادة إعمار تلك المناطق وترميمها، كما أنشأوا جهاز شرطة خاصًا بهم إضافة إلى عدد من الوزارات داخل نطاق نفوذهم.

كما استطاعوا تأمين عتاد عسكري ثقيل شمل مدرعات وطائرات حربية، مما عزز من قوتهم داخل المدينة بشكل ملحوظ. ولا يزال نفوذهم حاضرًا حتى الآن، في ظل صراع مستمر، إذ تخوض CIA ووزارة الداخلية مواجهة مفتوحة ضد تحركاتهم وأنشطتهم الإجرامية.`,
    image: 'https://i.postimg.cc/vHLsDTDH/d0d769242e2608b3.jpg'
  },
  {
    id: 'big_boss',
    subject: 'البيق بوس والسلاح البيولوجي',
    content: `كان البيق بوس والريفن ينفذان عمليات سطو على البنوك في لوس أنجلوس، ما أدى إلى نشوب عداوة بينهم وبين رئيس الاستخبارات المركزية ألفا، وكذلك دلتا أول وزير في وزارة الداخلية. ومع تصاعد هذا العداء وقعت بينهم عدة اشتباكات ومواجهات متكررة. وفي أحد الأيام تمكنت مجموعة الريفن من القبض على بيتا، الذي كان يشغل منصب قائد داخل وكالة الاستخبارات المركزية. وبعد فترة قصيرة تمت مداهمة أحد مقرات الريفن، حيث أُلقي القبض على البيق بوس وأُعدم من كان برفقته. وخلال تلك الأحداث دار حوار بين البيق بوس وألفا بشأن بيتا، وفي نهاية الأمر تم تسليم بيتا كما جرى تحرير البيق بوس. لاحقًا تبيّن أن البيق بوس كان مؤسس فيروس بالغ الخطورة. ومن أجل القضاء على هذا التهديد غادر ألفا إلى ولاية أخرى للعمل على إنهاء الفيروس، وتمكن من ذلك بنجاح بمساعدة مكتب التحقيقات الفيدرالي FBI، قبل أن يعود مجددًا إلى الولاية. وبعد عودته بفترة وصلت إلى ألفا معلومات عن تحركات البيق بوس. حاول الأخير القبض عليه وتمكن بالفعل من الإمساك به ونقله إلى مكان معزول، غير أن المفاجأة كانت أن الشخص الذي قبض عليه لم يكن ألفا الحقيقي بل شخصًا آخر. وفي تلك اللحظة انقلبت الموازين حيث أُلقي القبض على البيق بوس نفسه، وفجأة أعلن أنه هو صاحب الفيروس وأنه في حال لم يطمئن الأشخاص الذين يعملون معه فسيتم تفعيل الفيروس.

 وإلى هنا تنتهي الأحداث، على أن يتم شرحها لاحقًا في ثريد مخصص.`,
    image: 'https://i.postimg.cc/4dvV7pcb/c031e5c068b02128.jpg'
  }
];
